#Подключаем модуль рандом(импортируем оттуда всё)
from random import *

#Создаём функцию, которая проверяет корретность введённых данных
def is_value(num):
    return num.isdigit() and 1 <= int(num) <= 100

#Генерируем случайное число от 1 до 100
num1 = randint(1, 100)
#Выводим текст приветствия пользователю
print('Добро пожаловать в числовую угадайку')
#Запрос данных у пользователя
flag = True
cnt = 0
while flag:
    print('Введите число от 1 до 100')
    x = input()
    if is_value(x):
        x = int(x)
        cnt += 1
        #Сравнение введённого числа с загаданным
        if x < num1:
            print('Ваше число меньше загаданного, попробуйте еще разок')
        elif x > num1:
            print('Ваше число больше загаданного, попробуйте еще разок')
        else:
            print('Вы угадали, поздравляем!')
            flag = False
    else:
        print('А может быть все-таки введем целое число от 1 до 100?')

#Количество попыток угадывания
print('Столько раз вы пытались угадать:', cnt)
# Прощаемся с пользователем
print('Спасибо, что играли в числовую угадайку. Еще увидимся...')