from random import *

#Функция вывода случайного ответа
def choice(answers):
    num = randint(0, 19)
    return answers[num]

#список ответов
list_answers = [ 'Бесспорно', 'Мне кажется - да', "Пока неясно, попробуй снова", "Даже не думай", 'Предрешено', 'Вероятнее всего', 'Спроси позже', 'Мой ответ - нет', 'Никаких сомнений', 'Хорошие перспективы',                        	
'Лучше не рассказывать', 'По моим данным - нет', 'Определённо да', 'Знаки говорят - да', 'Сейчас нельзя предсказать', 'Перспективы не очень хорошие',
'Можешь быть уверен в этом', 'Да', 'Сконцентрируйся и спроси опять', 'Весьма сомнительно']

#Приветствие пользователя
print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')
print('Как вас зовут?')
name_user = input()
print(f'Привет, {name_user}.')

#Основной цикл с ответом на вопросы
while True:
    print('Задайте шару вопрос')
    res1 = input()
    print(choice(list_answers))
    print('Вы хотите задать ещё один вопрос?')
    res = input()
    if res == 'да' or res == 'Да':
        continue
    else:
        print('Возвращайся если возникнут вопросы!')
        break
